{
      "Video_1": "longest substring without repeating characters a lot to be in the question name.\nfind the length of the longest possible substring in SCR without any repeating.\nthe longest string without any repeating characters that you are we can see.\nBCD is a valid JSON string of length 4 without any repeating characters.\nwhy allsolution is 4 the longest possible substrings of length 4 as we.\nwhich of them has the maximum length without any repeating characters that is.\ndo that let's take a look now we had two pointers both starting.\nso when we should be a long is possible substrings of length 2.\nsecond be something interesting facts discussed are start is going to point the.\ncomputing the length that is start - end and we're going to be.\nstoring the maximum possible length inside a variable called this Max records the.\ntracking start - and at every single iteration and max is going to.\nYours always going to be moving along with the I look length constantly.\nguys that the solution to the problem longest string without repeating characters if.",
      "Video_2": "to offer that being said let's take a look at them in case.\nat the explanation of cases let me to elucidate the problem novino English.\nchair distorted lexicographically is because the first letter 7 order ABC let's have.\nessentially this is lexicographically started because she comes before Hell in the English.\nalphabet and it comes before as a look at these two coolant c.\nthe first what is lexicographically greater than the second word so this is.\nthe end of the second string in this condition we got to check.\nwhether the length of the second string is greater than that of the.\nfirst only then it said to be lexicographically sorted in increasing order in.\nthis case that's not true so this is not sorted in increasing order.\nus we got to check whether these three words are lexicographically sorted according.\nlooks the character is the first alphabet which is voice location is zero.\nthe character based s alphabet which location is one she is the third.\nof 25 instead let's try decoding the string right here making and Ari.\nfirst string but the second sitting still has characters in at meaning the.\nfirst string is valid that have a look at another scenario equal are.\nof string to an output is zero and finally if we reach two."
}